let dict = {
    "い": "ウホ",
    "う": "ウ",
    "ん": "ン",
    "し": "ウッ",
    "の": "ウー",
    "か": "ホウ",
    "と": "ホホ",
    "た": "ホッ",
    "に": "ホー",
    "れ": "ウホウ",
    "な": "ウホホ",
    "く": "ウホー",
    "て": "ウホッ",
    "は": "ウーホ",
    "こ": "ウーッ",
    "わ": "ウッホ",
    "き": "ウッウ",
    "る": "ウッー",
    "が": "ホウホ",
    "を": "ホウッ",
    "で": "ホウー",
    "り": "ホホウ",
    "ょ": "ホホホ",
    "あ": "ホホー",
    "も": "ホホッ",
    "す": "ホーホ",
    "ら": "ホーッ",
    "じ": "ホッウ",
    "っ": "ッ",
    "せ": "ホッホ",
    "つ": "ホッー",
    "ま": "ウホウホ",
    "だ": "ウホウー",
    "ち": "ウホウッ",
    "け": "ウホホウ",
    "よ": "ウホホホ",
    "そ": "ウホホー",
    "お": "ウホホッ",
    "さ": "ウホーウ",
    "め": "ウホーホ",
    "ゅ": "ウホーッ",
    "み": "ウホッウ",
    "ど": "ウホッホ",
    "え": "ウホッー",
    "ふ": "ウッウホ",
    "ひ": "ウッウー",
    "ほ": "ホ",
    "ば": "ウッウッ",
    "や": "ウッホウ",
    "ろ": "ウッホホ",
    "ぎ": "ウッホー",
    "げ": "ウッホッ",
    "ね": "ウッーウ",
    "び": "ウッーホ",
    "む": "ウッーッ",
    "ぶ": "ウーウホ",
    "ゃ": "ウーウー",
    "ゆ": "ウーウッ",
    "ぜ": "ウーホウ",
    "べ": "ウーホホ",
    "へ": "ウーホー",
    "ご": "ウーホッ",
    "ざ": "ウーッウ",
    "ず": "ウーッホ",
    "ぼ": "ウーッー",
    "ぐ": "ホウホウ",
    "ぽ": "ホウホホ",
    "ぞ": "ホウホー",
    "ぷ": "ホウホッ",
    "づ": "ホホウホ",
    "ぱ": "ホホウー",
    "ぃ": "ホホウッ",
    "ぺ": "ホホホウ",
    "ぴ": "ホホホホ",
    "ぇ": "ホホホー",
    "ぁ": "ホホホッ",
    "ぬ": "ホッウホ",
    "ぉ": "ホッウー",
    "ぅ": "ホッウッ",
    "ぢ": "ホッホウ",
    "ー": "ー",
    "　":"　",
    " ": " "
};

function encode(input) {
    let output = "";
    Array.prototype.forEach.call(input, function (s) {
        if (dict[s]) {
            output += dict[s] + '​';
        }
    });
    return output;
}

function decode(input){
    let output = "";
    input.split('​').forEach(element => {
        const key = Object.keys(dict).find(x => dict[x] == element)
        if(key) {
            output += key;
        }
    });
    return output;
}
